"""
ЗАДАНИЕ
--------------------------------------------------------------------------------
Написать функцию, которая возвращает длину множество
"""


def set_length(collection: set) -> int:

    return len(collection)


if __name__ == '__main__':
    assert set_length({1, 2, 3, 4}) == 4
    print('Решено!')
